- one to many relationship in python

In [6]:
import re
from io import StringIO
import pandas as pd

In [7]:
data = """
id  customer           products
0         0            1 0 1 0
1        22  0 5 0 4 5 3 2 1 1
2        57              5 2 4
""".strip()

In [8]:
data

'id  customer           products\n0         0            1 0 1 0\n1        22  0 5 0 4 5 3 2 1 1\n2        57              5 2 4'

In [9]:
data = re.sub(r"\s{2,}",",",data)
data

'id,customer,products\n0,0,1 0 1 0\n1,22,0 5 0 4 5 3 2 1 1\n2,57,5 2 4'

In [11]:
df = pd.read_csv(StringIO(data))
df

   id  customer           products
0   0         0            1 0 1 0
1   1        22  0 5 0 4 5 3 2 1 1
2   2        57              5 2 4

In [12]:
df.products.str.split()

0                   [1, 0, 1, 0]
1    [0, 5, 0, 4, 5, 3, 2, 1, 1]
2                      [5, 2, 4]
Name: products, dtype: object

In [13]:
df["product_id"] = df.products.str.split()

In [14]:
df

   id  customer           products                   product_id
0   0         0            1 0 1 0                 [1, 0, 1, 0]
1   1        22  0 5 0 4 5 3 2 1 1  [0, 5, 0, 4, 5, 3, 2, 1, 1]
2   2        57              5 2 4                    [5, 2, 4]

In [15]:
df = df.explode("product_id", ignore_index=False)

In [16]:
df

   id  customer           products product_id
0   0         0            1 0 1 0          1
0   0         0            1 0 1 0          0
0   0         0            1 0 1 0          1
0   0         0            1 0 1 0          0
1   1        22  0 5 0 4 5 3 2 1 1          0
1   1        22  0 5 0 4 5 3 2 1 1          5
1   1        22  0 5 0 4 5 3 2 1 1          0
1   1        22  0 5 0 4 5 3 2 1 1          4
1   1        22  0 5 0 4 5 3 2 1 1          5
1   1        22  0 5 0 4 5 3 2 1 1          3
1   1        22  0 5 0 4 5 3 2 1 1          2
1   1        22  0 5 0 4 5 3 2 1 1          1
1   1        22  0 5 0 4 5 3 2 1 1          1
2   2        57              5 2 4          5
2   2        57              5 2 4          2
2   2        57              5 2 4          4

In [17]:
result = df.groupby(["id", "customer", "product_id"], as_index=False).agg(
  product_qty=("product_id", "size"))
result

    id  customer product_id  product_qty
0    0         0          0            2
1    0         0          1            2
2    1        22          0            2
3    1        22          1            2
4    1        22          2            1
5    1        22          3            1
6    1        22          4            1
7    1        22          5            2
8    2        57          2            1
9    2        57          4            1
10   2        57          5            1

In [18]:
# Importing the StringIO module.
from io import StringIO 
 
 
# The arbitrary string.
string ='This is initial string.'
 
# Using the StringIO method to set
# as file object. Now we have an
# object file that we will able to
# treat just like a file.
file = StringIO(string)
 
# this will read the file
print(file.read())
 
# We can also write this file.
file.write(" Welcome to geeksforgeeks.")
 
# This will make the cursor at
# index 0.
file.seek(0)
 
# This will print the file after
# writing in the initial string.
print('The string after writing is:', file.read())

This is initial string.
The string after writing is: This is initial string. Welcome to geeksforgeeks.